/*--------------------------------------------------------------------------*/
/**@file   clock.h
   @brief  时钟配置
   @details
   @author
   @date   2010-12-13
   @note
*/
/*----------------------------------------------------------------------------*/
#ifndef __CLCOK_H__
#define __CLOCK_H__


#ifdef __C51__
#include "config.h"
/*----------------------------------------------------------------------------*/
/**@brief   PLL输入时钟选择
   @param   select: 0--选择32K， 1--选择7.6M， 2--选择12M， 3--其他
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void PLL_input(u8 select);

/*----------------------------------------------------------------------------*/
/**@brief   PLL输出方式选择
   @param   select: 0--选择输入时钟乘以2， 1--选择48M输出（只能是输入时钟为32K,7.6M, 12M时使用）
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void PLL_output(u8 select);

/*----------------------------------------------------------------------------*/
/**@brief   主时钟树选择
   @param   select: 0--选择RC，1--高速时钟，2--PLL的输出，3--32K
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void mainclock_select(u8 select);


/*----------------------------------------------------------------------------*/
/**@brief   系统时钟选择（给CPU及大部分外设）
   @param   select: 0--与主时钟树同频，1--主时钟频率的一半
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void sysclock_div2(u8 select);

/*----------------------------------------------------------------------------*/
/**@brief   解码模块时钟选择
   @param   select: 0--与主时钟树同频，1--主时钟频率的一半
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void decodeclock_div2(u8 select);


/*----------------------------------------------------------------------------*/
/**@brief   OTP模块时钟选择
   @param   select: 0--与主时钟树同频，1--主时钟频率的一半
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void otpclock_div2(u8 select);

/*----------------------------------------------------------------------------*/
/**@brief   P05输出时钟源选择
   @param   select: 0--普通IO，1--高速晶振, 2--32K晶振, 3--PLL输出时钟，如果PLL未打开，则输出RC时钟
   @return  无
   @note
*/
/*----------------------------------------------------------------------------*/
void P05_source_select(u8 select);

void system_sleep(void);
#endif

//PLL 输入
#define PLL_IN_32K      0
#define PLL_IN_76M      1
#define PLL_IN_12M      2
#define PLL_IN_OTHER    3

//PLL 输出
#define PLL_OUT_DOUBLE   0
#define PLL_OUT_48M      1


//主时钟选择
#define MAIN_CLK_RC      0
#define MAIN_CLK_HOSC    1
#define MAIN_CLK_PLL     2
#define MAIN_CLK_32K     3

//时钟分频选择
#define SYS_CLK_NOT_DIV2     0
#define SYS_CLK_DIV2         1

#define DECODE_CLK_NOT_DIV2     0
#define DECODE_CLK_DIV2         1

#define OTP_CLK_NOT_DIV2     0
#define OTP_CLK_DIV2         1

#endif
